# Необходимо написать программу, которая будет считывать со стандартного ввода строку. 
# Нужно разбить строку на слова, словом будем считать последовательность символов отличных от пробелов 
# (то есть знаки пунктуации будут входить в слова). Далее нужно посчитать и вывести среднее число символов 
# в словах этого текста. Точность проверяется до 2го знака после запятой.
# * Решение можно реализовать в 2 строки кода.

import re

string = input("")

words = re.findall(r'\S+', string)

total_length = sum(len(word) for word in words)
average_length = total_length / len(words)

print("{:.2f}".format(average_length))